#include <string>
#include<stdio.h>
#include<iostream>
#pragma once
using namespace std;
class Game
{
private:
	string	matrix[6][15]={
		{ "_______________________________________________________________________" },//первоначальное игровое поле 
		{},
		{},
		{ "$", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " " ," "},
		{ "======================================================================="},
		{ "Счёт:"}
	};
	string	newmatrix[6][15] = {
		{ "_______________________________________________________________________" },//поле,которое будет использоваться после рестарта игры
		{},
		{},
		{ "$", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " " ," "},
		{ "======================================================================="},
		{ "Счёт:"}
	};
	bool stop=false;//переменная, которая показывает столкнулся ли динозаврик со стеной 
	int count = 0;//переменная счёта
	void step();//метод, который сдвигает поле влево на 1 
	void toDisplay();//метод для отрисовки поля
	void barrierGenerate();//метод, который генерирует преграды 
	void jump();//метод прыжка динозаврика
	void refresh();//метод обновления поля при рестарте игры
public:
	void start();//метод начала игры
};